<img src="https://cdn-icons-png.flaticon.com/512/4021/4021738.png" alt="" style="width: 25%; margin: 0 auto; height: auto; display: block;" />


# <center><span style="font-family: Nunito Sans bold; font-weight: normal; font-size: 30px; font-style: normal, letter-spacing: 6px; line-height: 37px; text-transform: uppercase; color: #4D4D4D">The Golden Age Of Video Games</span></center>

<center><span style="font-family: Nunito Sans bold; font-weight: normal; font-size: 20px; font-style: normal, letter-spacing: 3px; line-height: 21px; text-transform: none; color: #808080">"Courage need not be remembered, for it is never forgotten."</span> 
<span style="font-family: Nunito Sans; font-weight: normal; font-size: 17px; font-style: normal; letter-spacing: normal; line-height: 18px; text-transform: none; color: #808080;">- Legend of Zelda: Breath of the Wild</span></center>
<br>
<div style="border-top: 5px solid #9bc5f5; margin-top: 1px; margin-bottom: 1px"></div>
<br>
The video game industry is a rapidly growing industry that has seen significant success over the years. The industry has evolved from simple, pixelated games to complex, high-definition games that are immersive and engaging. According to Â Mordor Intelligence, the global gaming industry is expected to be worth more than $300 billion by 2027. 
<br>
<br>
The success of the industry can be attributed to several factors, including the rise of mobile gaming, the growth of esports, and the increasing popularity of streaming platforms like Twitch and YouTube Gaming. In addition, the COVID-19 pandemic has led to a surge in demand for gaming as people spend more time at home.  
Although the video game industry has achieved remarkable success, there is a debate about whether the present time is considered the 'golden age' of video games, or if that period has already passed.

The goal of this project is to explore the evolution of video games and their quality over time to determine when the video game industry was at its peak. 

I will look to answer this question by comparing game sales to both critic and user reviews to determine which years had the highest quality video games, and explore whether the overall quality of video games has improved as the gaming market has grown.

## The Data
The [dataset](https://www.kaggle.com/datasets/holmjason2/videogamedata?resource=download) was downloaded from kaggle and contains over 13,000 games ranging from 1977 to the middle of 2020. The data contains 2 tables listed below.
    
<h3 id="game_sales"><code>game_sales</code></h3>
<table>
<thead>
<tr>
<th style="text-align:left;">column</th>
<th>type</th>
<th>meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:left;"><code>Name</code></td>
<td>varchar</td>
<td>Name of the video game</td>
</tr>
<tr>
<td style="text-align:left;"><code>Platform</code></td>
<td>varchar</td>
<td>Gaming platform</td>
</tr>
<tr>
<td style="text-align:left;"><code>Publisher</code></td>
<td>varchar</td>
<td>Game publisher</td>
</tr>
<tr>
<td style="text-align:left;"><code>Developer</code></td>
<td>varchar</td>
<td>Game developer</td>
</tr>
<tr>
<td style="text-align:left;"><code>Games_Sold</code></td>
<td>float</td>
<td>Number of copies sold (millions)</td>
</tr>
<tr>
<td style="text-align:left;"><code>Year</code></td>
<td>int</td>
<td>Release year</td>
</tr>
</tbody>
</table>
<h3 id="reviews"><code>reviews</code></h3>
<table>
<thead>
<tr>
<th style="text-align:left;">column</th>
<th>type</th>
<th>meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:left;"><code>Name</code></td>
<td>varchar</td>
<td>Name of the video game</td>
</tr>
<tr>
<td style="text-align:left;"><code>Critic_Score</code></td>
<td>float</td>
<td>Critic score according to Metacritic</td>
</tr>
<tr>
<td style="text-align:left;"><code>User_Score</code></td>
<td>float</td>
<td>User score according to Metacritic</td>
</tr>
</tbody>
</table>

In [1]:
# !pip install ipython-sql
# !pip install sqlalchemy
# !pip install psycopg2-binary

In [2]:
%load_ext sql

import os
from dotenv import load_dotenv

load_dotenv()

True

In [3]:
# connecting to the database
host = 'localhost'
database = 'games'
user = os.getenv('SQL_USER')
password = os.getenv('SQL_PASSWORD')

connection_string = f"postgresql://{user}:{password}@{host}/{database}"
    
%sql $connection_string

## Finding Missing Values
One limitation of the data is that there is not any reviews data for some of the games on the game_sales table. The queries below show that just under half of the games are missing critic scores and user scores data. It appears that many of the games with missing review data are older or smaller indie games.

In [4]:
%%sql
-- number of entries without a review

SELECT COUNT(*)
FROM game_sales AS gs
LEFT JOIN reviews AS r
ON gs.game_id = r.game_id
WHERE r.critic_score IS NULL AND r.user_score IS NULL

 * postgresql://postgres:***@localhost/games
1 rows affected.

[(9616,)]

In [5]:
%%sql
-- number of missing critic scores

SELECT COUNT(*)
FROM game_sales AS gs
LEFT JOIN reviews AS r
ON gs.game_id = r.game_id
WHERE r.critic_score IS NULL;

 * postgresql://postgres:***@localhost/games
1 rows affected.

[(9631,)]

In [6]:
%%sql
-- number of missing user scores

SELECT COUNT(*)
FROM game_sales AS gs
LEFT JOIN reviews AS r
ON gs.game_id = r.game_id
WHERE r.user_score IS NULL;

 * postgresql://postgres:***@localhost/games
1 rows affected.

[(17377,)]

In [7]:
%%sql
-- seeing which games over all platforms have no reviews

SELECT COUNT(*)
FROM (SELECT game, 
       COUNT(*), 
       SUM(games_sold) games_sold, 
       ROUND(AVG(user_score), 2) user_score, 
       ROUND(AVG(critic_score),2) critic_score
      FROM (SELECT *
            FROM game_sales gs
            LEFT JOIN reviews r
            ON gs.game_id = r.game_id
            ORDER BY games_sold DESC) joined_data
      GROUP BY game
      ORDER BY games_sold DESC) grouped_games
WHERE critic_score IS NULL AND user_score IS NULL;

 * postgresql://postgres:***@localhost/games
1 rows affected.

[(7021,)]

In [8]:
%%sql

SELECT COUNT(*)
FROM reviews

 * postgresql://postgres:***@localhost/games
1 rows affected.

[(19600,)]

## Finding the Top Selling Video Games
The query below shows the best-selling video games were released between 1985 to 2017. I will use data from the <code>reviews</code> table to gain more insight on the best years for video games.

In [9]:
%%sql

SELECT *
FROM game_sales
ORDER BY games_sold DESC
LIMIT 10

 * postgresql://postgres:***@localhost/games
10 rows affected.

[(1, 'Wii Sports', 'Wii', 'Nintendo', 'Nintendo EAD', Decimal('82.90'), 2006),
 (2, 'Super Mario Bros.', 'NES', 'Nintendo', 'Nintendo EAD', Decimal('40.24'), 1985),
 (3, 'Counter-Strike: Global Offensive', 'PC', 'Valve', 'Valve Corporation', Decimal('40.00'), 2012),
 (4, 'Mario Kart Wii', 'Wii', 'Nintendo', 'Nintendo EAD', Decimal('37.32'), 2008),
 (5, "PLAYERUNKNOWN'S BATTLEGROUNDS", 'PC', 'PUBG Corporation', 'PUBG Corporation', Decimal('36.60'), 2017),
 (6, 'Minecraft', 'PC', 'Mojang', 'Mojang AB', Decimal('33.15'), 2010),
 (7, 'Wii Sports Resort', 'Wii', 'Nintendo', 'Nintendo EAD', Decimal('33.13'), 2009),
 (8, 'Pokemon Red / Green / Blue Version', 'GB', 'Nintendo', 'Game Freak', Decimal('31.38'), 1998),
 (9, 'New Super Mario Bros.', 'DS', 'Nintendo', 'Nintendo EAD', Decimal('30.80'), 2006),
 (10, 'New Super Mario Bros. Wii', 'Wii', 'Nintendo', 'Nintendo EAD', Decimal('30.30'), 2009)]

## Years that video game critics loved
The queries below look at what the critics think. The first query looks at the average critic score over each year, but some of those years only have one game. I updated the query in the next cell to only include years where more than 4 video games were released. From these finding it appears the critics where high on games from the earlier years.

In [10]:
%%sql

SELECT gs.year,
       ROUND(AVG(r.critic_score), 2) AS  avg_critic_score,
       COUNT(*) AS num_games
FROM game_sales gs
INNER JOIN reviews r
ON gs.game_id = r.game_id
WHERE critic_score IS NOT NULL
GROUP BY gs.year
ORDER BY avg_critic_score DESC
LIMIT 10;

 * postgresql://postgres:***@localhost/games
10 rows affected.

[(1984, Decimal('9.50'), 1),
 (1992, Decimal('9.13'), 4),
 (1982, Decimal('9.00'), 1),
 (1994, Decimal('8.72'), 6),
 (1990, Decimal('8.63'), 6),
 (1991, Decimal('8.49'), 8),
 (2020, Decimal('8.26'), 9),
 (1993, Decimal('8.03'), 11),
 (2019, Decimal('7.88'), 37),
 (1989, Decimal('7.66'), 5)]

In [44]:
%%sql

SELECT gs.year,
       ROUND(AVG(r.critic_score), 2) AS avg_critic_score,
       COUNT(*) AS num_games
FROM game_sales gs
INNER JOIN reviews r
ON gs.game_id = r.game_id
WHERE r.critic_score IS NOT NULL
GROUP BY gs.year
HAVING COUNT(*) > 4
ORDER BY avg_critic_score DESC
LIMIT 10;

 * postgresql://postgres:***@localhost/games
10 rows affected.

[(1994, Decimal('8.72'), 6),
 (1990, Decimal('8.63'), 6),
 (1991, Decimal('8.49'), 8),
 (2020, Decimal('8.26'), 9),
 (1993, Decimal('8.03'), 11),
 (2019, Decimal('7.88'), 37),
 (1989, Decimal('7.66'), 5),
 (1985, Decimal('7.58'), 5),
 (2014, Decimal('7.54'), 264),
 (2013, Decimal('7.46'), 284)]

In [132]:
%%sql
-- critics top 10 years vs amount sold in millions

SELECT year AS critic_top_years, SUM(games_sold) AS total_sold
FROM game_sales
WHERE year IN (SELECT year 
               FROM
                (SELECT gs.year,
                   ROUND(AVG(r.critic_score), 2) AS avg_critic_score,
                   COUNT(*) AS num_games
                   FROM game_sales gs
                   INNER JOIN reviews r
                   ON gs.game_id = r.game_ID
                   WHERE r.critic_score IS NOT NULL
                   GROUP BY gs.year
                   HAVING COUNT(*) > 4
                   ORDER BY avg_critic_score DESC
                   LIMIT 10) year_col
              )
GROUP BY year

 * postgresql://postgres:***@localhost/games
10 rows affected.

[(1994, Decimal('62.97')),
 (2014, Decimal('454.16')),
 (1991, Decimal('60.64')),
 (2019, Decimal('117.12')),
 (1989, Decimal('76.87')),
 (1985, Decimal('93.72')),
 (2013, Decimal('470.88')),
 (1993, Decimal('64.19')),
 (1990, Decimal('52.40')),
 (2020, Decimal('26.25'))]

## Years that dropped off the critics' favorites list
The new list of the critics' top games with the 'num_games' column reflects years that had quite a few well-reviewed games rather than just one or two hits. Below I identify years dropped off the list due to having four or fewer reviewed games.

First I created views of the overall top critic reviewd games by year and the top critic reviewed games with more than 4 games per year. lastly I created a view for top user scores by year, in order to compare critic scores and user scores.

In [12]:
%%sql

DROP VIEW IF EXISTS
    top_critic_years, 
    top_critic_years_more_than_four,
    top_user_years_more_than_four;
    
-- creating view of top critic reviewd games by year

CREATE VIEW top_critic_years AS
SELECT gs.year,
       ROUND(AVG(r.critic_score), 2) AS  avg_critic_score,
       COUNT(*) AS num_games
FROM game_sales gs
INNER JOIN reviews r
ON gs.game_id = r.game_id
WHERE critic_score IS NOT NULL
GROUP BY gs.year
ORDER BY avg_critic_score DESC
LIMIT 20;

-- creating view of top critic reviewed game by year with more than 4 games

CREATE VIEW top_critic_years_more_than_four AS
SELECT gs.year,
       ROUND(AVG(r.critic_score), 2) AS avg_critic_score,
       COUNT(*) AS num_games
FROM game_sales gs
INNER JOIN reviews r
ON gs.game_id = r.game_id
WHERE r.critic_score IS NOT NULL
GROUP BY gs.year
HAVING COUNT(*) > 4
ORDER BY avg_critic_score DESC
LIMIT 20;

-- creating view of top user scores by year 

CREATE VIEW top_user_years_more_than_four AS
SELECT gs.year,
       ROUND(AVG(r.user_score), 2) AS avg_user_score,
       COUNT(*) AS num_games
FROM game_sales gs
INNER JOIN reviews r
ON gs.game_id = r.game_ID
WHERE r.user_score IS NOT NULL
GROUP BY gs.year
HAVING COUNT(*) > 4
ORDER BY avg_user_score DESC
LIMIT 20;

-- checking views
SELECT table_schema, table_name 
FROM information_schema.views 
WHERE table_schema NOT IN ('information_schema', 'pg_catalog') 
ORDER BY table_schema, table_name;

 * postgresql://postgres:***@localhost/games
Done.
Done.
Done.
Done.
3 rows affected.

[('public', 'top_critic_years'),
 ('public', 'top_critic_years_more_than_four'),
 ('public', 'top_user_years_more_than_four')]

In [13]:
%%sql
-- years that dropped off critics' top 20 list

SELECT year, avg_critic_score
FROM top_critic_years
EXCEPT
SELECT year, avg_critic_score
FROM top_critic_years_more_than_four
ORDER BY avg_critic_score DESC;

 * postgresql://postgres:***@localhost/games
4 rows affected.

[(1984, Decimal('9.50')),
 (1992, Decimal('9.13')),
 (1982, Decimal('9.00')),
 (1981, Decimal('7.60'))]

## Years video game players loved
Based solely on the critic_score, it appears that the early 1990s could potentially be considered the golden age of video games. I will now look at the user scores to see how they compare.

In [14]:
%%sql

SELECT gs.year,
       ROUND(AVG(r.user_score), 2) AS avg_user_score,
       COUNT(*) AS num_games
FROM game_sales gs
INNER JOIN reviews r
ON gs.game_id = r.game_ID
WHERE r.user_score IS NOT NULL
GROUP BY gs.year
HAVING COUNT(*) > 4
ORDER BY avg_user_score DESC
LIMIT 10;

 * postgresql://postgres:***@localhost/games
10 rows affected.

[(1999, Decimal('9.10'), 5),
 (2010, Decimal('8.78'), 22),
 (2007, Decimal('8.57'), 26),
 (2009, Decimal('8.57'), 44),
 (2003, Decimal('8.53'), 6),
 (2002, Decimal('8.48'), 5),
 (2008, Decimal('8.40'), 52),
 (2006, Decimal('8.26'), 16),
 (2004, Decimal('7.91'), 7),
 (2001, Decimal('7.77'), 7)]

In [131]:
%%sql
-- players top 10 years vs amount sold in millions

SELECT year AS user_top_years, SUM(games_sold) AS total_sold
FROM game_sales
GROUP BY year
HAVING year IN (SELECT year 
                FROM
                    (SELECT 
                       gs.year,
                       ROUND(AVG(r.user_score), 2) AS avg_user_score,
                       COUNT(*) AS num_games
                     FROM game_sales gs
                     INNER JOIN reviews r
                     ON gs.game_id = r.game_ID
                     WHERE r.user_score IS NOT NULL
                     GROUP BY gs.year
                     HAVING COUNT(*) > 4
                     ORDER BY avg_user_score DESC
                     LIMIT 10) year_col
                   )

 * postgresql://postgres:***@localhost/games
10 rows affected.

[(2008, Decimal('734.62')),
 (2010, Decimal('676.41')),
 (2009, Decimal('694.39')),
 (2003, Decimal('400.79')),
 (2007, Decimal('634.62')),
 (2002, Decimal('389.25')),
 (2004, Decimal('452.77')),
 (2006, Decimal('520.71')),
 (2001, Decimal('346.26')),
 (1999, Decimal('268.49'))]

## Years that both players and critics loved

As shown above, it appears that while critics hold games from the early 1990s in high regard, players tend to rate games from the early 2000s more favorably. 

In the query below, I looked to examine what years both players and critics loved. However, after reviewing the results, I found that there were no years that appeared in both critics' and players' top ten rankings. In order to gain a more comprehensive understanding, I expanded my analysis to include the top twenty years for both groups.

Based on my findings, it seems that both critics and players agree that the 2010s were a strong period for video games. However, it's worth noting that this era may not necessarily be their favorite as these results are outside both of their top 10s.

In [24]:
%%sql 

-- Select the year results that appear on both tables

SELECT year
FROM top_critic_years_more_than_four
INTERSECT
SELECT year
FROM top_user_years_more_than_four

 * postgresql://postgres:***@localhost/games
12 rows affected.

[(2013,),
 (2003,),
 (2015,),
 (2014,),
 (2004,),
 (2020,),
 (2001,),
 (2017,),
 (2016,),
 (1999,),
 (2012,),
 (2018,)]

## Sales in the best video game years
It looks like there are twelve years that both users and critics agreed were outside the top 10 but inside the top twenty! 
We know that critics and players liked these years, but what about video game makers? Were sales good? Let's find out.

In [16]:
%%sql
SELECT year, 
       SUM(games_sold) AS total_games_sold
FROM game_sales
GROUP BY year
HAVING year IN (SELECT year
               FROM top_critic_years_more_than_four
               INTERSECT
               SELECT year
               FROM top_user_years_more_than_four)
ORDER BY total_games_sold DESC;

 * postgresql://postgres:***@localhost/games
12 rows affected.

[(2013, Decimal('470.88')),
 (2012, Decimal('455.69')),
 (2014, Decimal('454.16')),
 (2004, Decimal('452.77')),
 (2003, Decimal('400.79')),
 (2015, Decimal('396.06')),
 (2017, Decimal('393.43')),
 (2016, Decimal('368.75')),
 (2001, Decimal('346.26')),
 (2018, Decimal('275.66')),
 (1999, Decimal('268.49')),
 (2020, Decimal('26.25'))]

## Years that had the best sales regardless of reviews
The query below shows that sales for video games reached their peak between 2005 and 2014. The second query shows that total sales and number of games were steadily increasing until 2008, when sales and total games sarted to decline.

In [149]:
%%sql
-- Top 10 years by sale

SELECT year, sum(games_sold) AS total_sales
FROM game_sales
GROUP BY year
ORDER BY total_sales DESC
LIMIT 10

 * postgresql://postgres:***@localhost/games
10 rows affected.

[(2008, Decimal('734.62')),
 (2009, Decimal('694.39')),
 (2010, Decimal('676.41')),
 (2007, Decimal('634.62')),
 (2011, Decimal('633.36')),
 (2006, Decimal('520.71')),
 (2013, Decimal('470.88')),
 (2005, Decimal('456.29')),
 (2012, Decimal('455.69')),
 (2014, Decimal('454.16'))]

In [151]:
%%sql
-- Look to see how sales and reviews have changed over time

SELECT gs.year, 
       SUM(gs.games_sold) AS total_sold, 
       ROUND(AVG(r.critic_score), 2) AS avg_critic_score, 
       ROUND(AVG(r.user_score), 2) AS avg_user_score,  
       COUNT(*) AS num_games,
       ROUND(ABS(AVG(r.critic_score) - AVG(r.user_score)),2) AS score_variation
FROM game_sales gs
LEFT JOIN reviews r
ON gs.game_id = r.game_id
GROUP BY year
ORDER BY year DESC
LIMIT 50

 * postgresql://postgres:***@localhost/games
44 rows affected.

[(2020, Decimal('26.25'), Decimal('8.26'), Decimal('7.50'), 13, Decimal('0.76')),
 (2019, Decimal('117.12'), Decimal('7.88'), Decimal('6.45'), 63, Decimal('1.43')),
 (2018, Decimal('275.66'), Decimal('7.34'), Decimal('6.58'), 703, Decimal('0.77')),
 (2017, Decimal('393.43'), Decimal('7.37'), Decimal('6.82'), 789, Decimal('0.55')),
 (2016, Decimal('368.75'), Decimal('7.38'), Decimal('6.92'), 780, Decimal('0.46')),
 (2015, Decimal('396.06'), Decimal('7.41'), Decimal('6.89'), 759, Decimal('0.52')),
 (2014, Decimal('454.16'), Decimal('7.54'), Decimal('7.01'), 755, Decimal('0.53')),
 (2013, Decimal('470.88'), Decimal('7.46'), Decimal('6.98'), 639, Decimal('0.47')),
 (2012, Decimal('455.69'), Decimal('7.37'), Decimal('7.07'), 755, Decimal('0.30')),
 (2011, Decimal('633.36'), Decimal('7.00'), Decimal('6.60'), 1299, Decimal('0.41')),
 (2010, Decimal('676.41'), Decimal('7.00'), Decimal('8.78'), 1401, Decimal('1.78')),
 (2009, Decimal('694.39'), Decimal('6.81'), Decimal('8.57'), 1616, Decimal('1.75')),
 (2008, Decimal('734.62'), Decimal('6.44'), Decimal('8.40'), 1536, Decimal('1.96')),
 (2007, Decimal('634.62'), Decimal('6.60'), Decimal('8.57'), 1236, Decimal('1.97')),
 (2006, Decimal('520.71'), Decimal('6.79'), Decimal('8.26'), 1035, Decimal('1.46')),
 (2005, Decimal('456.29'), Decimal('7.11'), Decimal('7.62'), 964, Decimal('0.51')),
 (2004, Decimal('452.77'), Decimal('7.14'), Decimal('7.91'), 785, Decimal('0.77')),
 (2003, Decimal('400.79'), Decimal('7.27'), Decimal('8.53'), 813, Decimal('1.27')),
 (2002, Decimal('389.25'), Decimal('7.02'), Decimal('8.48'), 821, Decimal('1.46')),
 (2001, Decimal('346.26'), Decimal('7.21'), Decimal('7.77'), 508, Decimal('0.56')),
 (2000, Decimal('259.61'), Decimal('7.06'), Decimal('8.45'), 412, Decimal('1.39')),
 (1999, Decimal('268.49'), Decimal('7.19'), Decimal('9.10'), 359, Decimal('1.91')),
 (1998, Decimal('283.42'), Decimal('7.15'), Decimal('8.80'), 342, Decimal('1.65')),
 (1997, Decimal('178.68'), Decimal('6.79'), Decimal('9.25'), 264, Decimal('2.46')),
 (1996, Decimal('154.78'), Decimal('6.76'), Decimal('8.50'), 291, Decimal('1.74')),
 (1995, Decimal('95.48'), Decimal('6.54'), Decimal('8.00'), 193, Decimal('1.46')),
 (1994, Decimal('62.97'), Decimal('8.72'), Decimal('8.80'), 104, Decimal('0.08')),
 (1993, Decimal('64.19'), Decimal('8.03'), Decimal('9.50'), 61, Decimal('1.47')),
 (1992, Decimal('74.95'), Decimal('9.13'), Decimal('8.25'), 40, Decimal('0.88')),
 (1991, Decimal('60.64'), Decimal('8.49'), Decimal('8.80'), 34, Decimal('0.31')),
 (1990, Decimal('52.40'), Decimal('8.63'), Decimal('9.30'), 21, Decimal('0.67')),
 (1989, Decimal('76.87'), Decimal('7.66'), Decimal('5.45'), 20, Decimal('2.21')),
 (1988, Decimal('27.69'), Decimal('7.00'), Decimal('8.10'), 17, Decimal('1.10')),
 (1987, Decimal('31.16'), Decimal('6.88'), Decimal('8.80'), 16, Decimal('1.92')),
 (1986, Decimal('21.40'), Decimal('5.83'), Decimal('8.10'), 18, Decimal('2.27')),
 (1985, Decimal('93.72'), Decimal('7.58'), Decimal('8.25'), 15, Decimal('0.67')),
 (1984, Decimal('7.82'), Decimal('9.50'), Decimal('7.40'), 12, Decimal('2.10')),
 (1983, Decimal('24.82'), None, None, 38, None),
 (1982, Decimal('43.39'), Decimal('9.00'), Decimal('7.40'), 47, Decimal('1.60')),
 (1981, Decimal('10.49'), Decimal('7.60'), Decimal('7.80'), 7, Decimal('0.20')),
 (1980, Decimal('2.58'), None, None, 6, None),
 (1979, Decimal('0.31'), None, None, 1, None),
 (1978, Decimal('6.19'), None, None, 9, None),
 (1977, Decimal('2.50'), None, None, 3, None)]

## Looking at the total sales, the average critic scores, and the average user scores by decade

In [164]:
%%sql
-- Total sales, avgerage critic score, and average user score in the 1970s

SELECT SUM(gs.games_sold) AS total_games_sales_70s,
       ROUND(AVG(r.critic_score), 2) AS critic_avg_rating_70s,
       ROUND(AVG(r.user_score), 2) AS user_avg_rating_70s,
       COUNT(*) AS num_games
FROM game_sales gs
LEFT JOIN reviews r
ON gs.game_id = r.game_id
WHERE year BETWEEN 1970 AND 1979;

 * postgresql://postgres:***@localhost/games
1 rows affected.

[(Decimal('9.00'), None, None, 13)]

In [112]:
%%sql
-- Total sales, avgerage critic score, and average user score in the 1980s

SELECT SUM(gs.games_sold) AS total_games_sales_80s,
       ROUND(AVG(r.critic_score), 2) AS critic_avg_rating_80s,
       ROUND(AVG(r.user_score), 2) AS user_avg_rating_80s,
       COUNT(*) AS num_games
FROM game_sales gs
LEFT JOIN reviews r
ON gs.game_id = r.game_id
WHERE year BETWEEN 1980 AND 1989;

 * postgresql://postgres:***@localhost/games
1 rows affected.

[(Decimal('339.94'), Decimal('7.13'), Decimal('7.50'), 196)]

In [128]:
%%sql
-- Total sales, avgerage critic score, and average user score in the 1990s

SELECT SUM(gs.games_sold) AS total_games_sales_90s,
       ROUND(AVG(r.critic_score), 2) AS critic_avg_rating_90s,
       ROUND(AVG(r.user_score), 2) AS user_avg_rating_90s,
       COUNT(*) AS num_games
FROM game_sales gs
LEFT JOIN reviews r
ON gs.game_id = r.game_id
WHERE year BETWEEN 1990 AND 1999;

 * postgresql://postgres:***@localhost/games
1 rows affected.

[(Decimal('1296.00'), Decimal('7.07'), Decimal('8.84'), 1709)]

In [129]:
%%sql
-- Total sales, avgerage critic score, and average user score in the 2000s

SELECT SUM(gs.games_sold) AS total_games_sales_00s,
       ROUND(AVG(r.critic_score), 2) AS critic_avg_rating_00s,
       ROUND(AVG(r.user_score), 2) AS user_avg_rating_00s,
       COUNT(*) AS num_games
FROM game_sales gs
LEFT JOIN reviews r
ON gs.game_id = r.game_id
WHERE year BETWEEN 2000 AND 2009;

 * postgresql://postgres:***@localhost/games
1 rows affected.

[(Decimal('4889.31'), Decimal('6.89'), Decimal('8.36'), 9726)]

In [111]:
%%sql
-- Total sales, avgerage critic score, and average user score in the 2010s

SELECT 
  SUM(gs.games_sold) AS total_games_sales_10s,
  ROUND(AVG(r.critic_score), 2) AS critic_avg_rating_10s,
  ROUND(AVG(r.user_score), 2) AS user_avg_rating_10s,
  COUNT(*) AS num_games
FROM game_sales gs
  LEFT JOIN reviews r
  ON gs.game_id = r.game_id
WHERE year BETWEEN 2010 AND 2019;

 * postgresql://postgres:***@localhost/games
1 rows affected.

[(Decimal('4241.52'), Decimal('7.28'), Decimal('6.85'), 7943)]

# Conclusion 
## The Golden Age of Video Games: The Late 90s to Mid-2000s
<br>
 <div style="border-top: 5px solid #9bc5f5; margin-top: 1px; margin-bottom: 1px"></div>
 
 After delving into a deep analysis of video game sales and reviews, my objective was to identify the Golden Age of Video Games. By leveraging the power of SQL, I meticulously examined data on game sales and critic and user reviews, aiming to unravel which years produced the highest quality video games and whether the quality of video games has improved as the gaming market has grown.

Based on the data analysis conducted, it appears that the Golden Age of Video Games was between the late 90s to mid-2000s. This was a period when video games were rapidly evolving, and sales were continuing to grow. Both critics and players hold games from this era in high regard, with critics rating games from the early 90s and the 2010s highly and with players rating games from the early 2000s more favorably.

Despite this, it's important to note that the 2010s were also a noteworthy period for video games, with both critics and players recognizing its strength. However, it's worth mentioning that this era did not make it to either group's top 10 rankings. Furthermore, the peak of the video game market occurred between 2005 and 2014, implying that the industry was becoming oversaturated with games.

Overall, it seems that the Golden Age of Video Games occurred during a time of rapid evolution and growth in the industry, which produced many iconic games that have stood the test of time. However, the video game industry is constantly changing, and new eras of innovation and success are sure to come in the future.